import type { PageSection } from '../types';

const section: PageSection = {
    type: "pdf_page",
    desktopFullImage: { th: "/page_032/032_p13_full_th.webp", en: "/page_032/032_p13_full_en.webp" },
    items: [
        {
            type: "pdf_sub_title",
            text: { th: "การถือครองหุ้นของคณะกรรมการบริษัทและผู้บริหาร ณ วันที่ 31 ธันวาคม 2568", en: "" },
            color: "#00a6f4",
            size: "sm",
            weight: "medium",
        },
        {
            type: "pdf_body_text",
            text: { th: "บริษัทฯ กำหนดให้กรรมการมีหน้าที่รายงานการถือครองหลักทรัพย์บริษัท บ้านปู จำกัด (มหาชน) ของตนเอง คู่สมรส บุตรที่ยังไม่บรรลุนิติภาวะ และนิติบุคคลที่เกี่ยวข้อง ต่อที่ประชุมคณะกรรมการบริษัทครั้งถัดไปหลังจากได้รับการแต่งตั้งเป็นกรรมการ หลังจากนั้นหากกรรมการ รวมทั้งคู่สมรส บุตรที่ยังไม่บรรลุนิติภาวะ และนิติบุคคลที่เกี่ยวข้อง มีการทำธุรกรรมการซื้อขายหลักทรัพย์ของบริษัท บ้านปู จำกัด (มหาชน) กรรมการท่านนั้นจะต้องรายงานการซื้อขายหลักทรัพย์ต่อที่ประชุมคณะกรรมการบริษัทครั้งถัดไปทุกครั้ง ทั้งนี้ การถือครองหุ้นของคณะกรรมการบริษัทและผู้บริหารณ วันที่ 31 ธันวาคม 2568 เป็นดังนี้", en: "" },
        },
        {
            type: "pdf_banner",
            src: { th: "/page_032/032_p13_mobile_table_th.webp", en: "" },
            minWidth: 800,
        },
    ],
};

export default section;
