import type { PageSection } from '../types';

const section: PageSection = {
    type: "pdf_page",
    desktopFullImage: { th: "/page_031/031_p06_full_th.webp", en: "/page_031/031_p06_full_en.webp" },
    items: [
        {
            type: "pdf_banner",
            src: { th: "/page_031/031_p06_mobile_th.webp", en: "/page_031/031_p06_mobile_en.webp" },
        },
        {
            type: "pdf_sub_title",
            text: { th: "นโยบายและแนวปฏิบัติที่เกี่ยวกับคณะกรรมการบริษัท ผู้ถือหุ้น และผู้มีส่วนได้เสีย", en: "" },
            color: "#00a6f4",
            size: "sm",
            weight: "medium",
        },
        {
            type: "pdf_body_text",
            text: {
                th: "คณะกรรมการบริษัทจัดทำนโยบายบรรษัทภิบาลไว้เป็นแนวทางในการดำเนินการให้แก่คณะกรรมการผู้บริหาร และพนักงานโดยยึดตามหลักการกำกับดูแลกิจการที่ดีสำหรับบริษัทจดทะเบียน ปี 2560 ของสำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์ ซึ่งประกอบด้วยหลักปฏิบัติ 8 ข้อหลัก ดังนี้",
                en: "",
            },
        },
        {
            type: "pdf_sub_title",
            text: { th: "หลักปฏิบัติที่ 1 ตระหนักถึงบทบาทและความรับผิดชอบของคณะกรรมการในฐานะผู้นำองค์กร ที่สร้างคุณค่าให้แก่กิจการอย่างยั่งยืน", en: "" },
            color: "#6b7280",
            size: "sm",
            weight: "medium",
        },
        {
            type: "pdf_body_text",
            text: {
                th: `คณะกรรมการบริษัทได้กำหนดหน้าที่ความรับผิดชอบของคณะกรรมการไว้ตั้งแต่ปี 2552 ในเอกสาร “แนวปฏิบัติ บริษัท บ้านปู จำกัด (มหาชน) ว่าด้วยคณะกรรมการบริษัท พ.ศ. 2552” โดยได้มีการปรับปรุงมาอย่างต่อเนื่อง และมีการปรับปรุงครั้งล่าสุดในปี 2567 เพื่อให้สอดคล้องกับหน้าที่ความรับผิดชอบ สภาพธุรกิจที่เปลี่ยนแปลงไป ระเบียบ ข้อบังคับ และ แนวทางบรรษัทภิบาล`,
                en: "",
            },
        },
    ],
};

export default section;
